holdtao/S32K144cmake/RTD/base_include/S32K116_M0.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>MPU</name>
      <description>MPU</description>
      <groupName>MPU</groupName>
      <baseAddress>0x4000D000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x820</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CESR</name>
          <description>Control/Error Status Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x812001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VLD</name>
              <description>Valid</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VLD_0</name>
                  <description>MPU is disabled. All accesses from all bus masters are allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VLD_1</name>
                  <description>MPU is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NRGD</name>
              <description>Number Of Region Descriptors</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NRGD_0</name>
                  <description>8 region descriptors</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NRGD_1</name>
                  <description>12 region descriptors</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NRGD_2</name>
                  <description>16 region descriptors</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSP</name>
              <description>Number Of Slave Ports</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HRL</name>
              <description>Hardware Revision Level</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPERR1</name>
              <description>Slave Port 1 Error</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SPERR1_0</name>
                  <description>No error has occurred for slave port 1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPERR1_1</name>
                  <description>An error has occurred for slave port 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPERR0</name>
              <description>Slave Port 0 Error</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SPERR0_0</name>
                  <description>No error has occurred for slave port 0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPERR0_1</name>
                  <description>An error has occurred for slave port 0.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EAR0</name>
          <description>Error Address Register, slave port 0</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EADDR</name>
              <description>Error Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EDR0</name>
          <description>Error Detail Register, slave port 0</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ERW</name>
              <description>Error Read/Write</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ERW_0</name>
                  <description>Read</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERW_1</name>
                  <description>Write</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EATTR</name>
              <description>Error Attributes</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EATTR_0</name>
                  <description>User mode, instruction access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EATTR_1</name>
                  <description>User mode, data access</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EATTR_2</name>
                  <description>Supervisor mode, instruction access</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EATTR_3</name>
                  <description>Supervisor mode, data access</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMN</name>
              <description>Error Master Number</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EPID</name>
              <description>Error Process Identification</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EACD</name>
              <description>Error Access Control Detail</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EAR1</name>
          <description>Error Address Register, slave port 1</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EADDR</name>
              <description>Error Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EDR1</name>
          <description>Error Detail Register, slave port 1</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ERW</name>
              <description>Error Read/Write</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ERW_0</name>
                  <description>Read</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERW_1</name>
                  <description>Write</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EATTR</name>
              <description>Error Attributes</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EATTR_0</name>
                  <description>User mode, instruction access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EATTR_1</name>
                  <description>User mode, data access</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EATTR_2</name>
                  <description>Supervisor mode, instruction access</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EATTR_3</name>
                  <description>Supervisor mode, data access</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMN</name>
              <description>Error Master Number</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EPID</name>
              <description>Error Process Identification</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EACD</name>
              <description>Error Access Control Detail</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RGD0_WORD0</name>
          <description>Region Descriptor 0, Word 0</description>
          <addressOffset>0x400</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SRTADDR</name>
              <description>Start Address</description>
              <bitOffset>5</bitOffset>
              <bitWidth>27</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RGD0_WORD1</name>
          <description>Region Descriptor 0, Word 1</description>
          <addressOffset>0x404</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENDADDR</name>
              <description>End Address</description>
              <bitOffset>5</bitOffset>
              <bitWidth>27</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
